In [4]:
import pandas as pd
import numpy as np

# PAIR PROGRAMMING PANDAS

¿Qué diferencia hay entre una Serie y un DataFrame?

Las series son una estructura de datos unidimensional, mientras que los Dataframe son estructuras bidimensionales con filas y columnas

## SERIES

Crea dos listas:
Una que se llame "valores" que tenga 7 números aleatorios.
Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [1]:
valores = [4,6,8,2,1,9,7]
indices = ['lunes','martes','miercoles','jueves','viernes','sabado','domingo']

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [7]:
pd1= pd.Series(valores,index=[indices])
pd1

lunes        4
martes       6
miercoles    8
jueves       2
viernes      1
sabado       9
domingo      7
dtype: int64

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez

In [35]:
pd2 = dict(zip(indices, valores))
pd2

{4: 'lunes',
 6: 'martes',
 8: 'miercoles',
 2: 'jueves',
 1: 'viernes',
 9: 'sabado',
 7: 'domingo'}

In [33]:
pd2 = zip(indices,valores)
pd2

In [37]:
pd2 = {}
for indice, valor in zip(valores,indices):
    pd2[indice] = valor
pd2

{'lunes': 4,
 'martes': 6,
 'miercoles': 8,
 'jueves': 2,
 'viernes': 1,
 'sabado': 9,
 'domingo': 7}

Crea una Serie con el diccionario creado en el punto anterior.

In [38]:
pd3 = pd.Series(pd2)
pd3

lunes        4
martes       6
miercoles    8
jueves       2
viernes      1
sabado       9
domingo      7
dtype: int64

¿Qué forma tiene esta última Serie?

In [39]:
forma = pd3.shape
forma

(7,)

¿Qué tipo de datos tiene?

In [40]:
datos = pd3.dtypes
datos

dtype('int64')

¿Qué tamaño tiene?

In [41]:
tamaño = pd3.size
tamaño

7

¿Cuáles son los índices de la Serie?

In [42]:
indices = pd3.index
indices

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

¿Y los values?

In [43]:
valores = pd3.values
valores

array([4, 6, 8, 2, 1, 9, 7])

Extrae el valor para el índice "lunes"

In [44]:
pd3['lunes']

4

Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [48]:
valores1 = pd3['lunes'],pd3['martes'],pd3['miercoles']
valores1

(4, 6, 8)

Extrae el valor para el índice "lunes" y "domingo".

In [49]:
pd3['lunes'], pd3['domingo']

(4, 7)

## DATAFRAMES

Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [5]:
array = np.empty((4,3))
array

array([[6.95331760e-310, 0.00000000e+000, 1.03977794e-312],
       [9.54898106e-313, 1.12465777e-312, 1.03977794e-312],
       [1.23075756e-312, 1.12465777e-312, 1.06099790e-312],
       [9.76118064e-313, 1.14587773e-312, 1.90979621e-312]])

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [6]:
pd10= pd.DataFrame(array, columns=['España','Francia','Italia'])
pd10

          España        Francia         Italia
0  6.953318e-310   0.000000e+00  1.039778e-312
1  9.548981e-313  1.124658e-312  1.039778e-312
2  1.230758e-312  1.124658e-312  1.060998e-312
3  9.761181e-313  1.145878e-312  1.909796e-312

Descarga el archivo "medallas" y carga el DataFrame.

In [7]:
medallas = pd.read_csv('medallas.csv', index_col = 'País')
medallas.drop(columns=['Unnamed: 0'], inplace=True)
medallas

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

Usando el loc extrae todas las columnas de la fila de Tailandia.

In [8]:
medallas.loc ['Tailandia',:]

Oro       132
Plata     175
Bronce    278
Name: Tailandia, dtype: int64

Usando el loc extrae todas las columnas de China e Irán.

In [9]:
medallas.loc [['China','Irán'], :]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [10]:
medallas.loc [['China','Irán'], ['Oro','Plata','Bronce']]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [11]:
medallas.iloc[5,:]

Oro       154
Plata     202
Bronce    315
Name: India, dtype: int64

Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [12]:
medallas.iloc[1::2,:]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [13]:
medallas.iloc[1::2,:]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

¿Qué país consiguió más de 200 medallas de oro?

In [14]:
medallas.loc[medallas['Oro']>200, :]

                Oro  Plata  Bronce
País
China          1473    994     720
Japón          1032   1037     985
Corea del Sur   745    663     827

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [15]:
medallas.loc[(medallas['Oro']>200) & (medallas['Plata']>1000),:]

        Oro  Plata  Bronce
País
Japón  1032   1037     985

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [16]:
medallas.loc[(medallas['Oro']>200) | (medallas['Bronce']>700),:]

                Oro  Plata  Bronce
País
China          1473    994     720
Japón          1032   1037     985
Corea del Sur   745    663     827

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [19]:
medallas['Total'] = medallas.sum(axis=1)
medallas

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446